<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"test-apply apply_apply_error","backend":"c3bb9f098d20abb5b69b72cceed1c8fbce6579ceb5dc60b0c9d4ebcbd1d7e069","plan_job_ref":"Job Test terraform-apply #617 at https://github.com/dflook/terraform-github-actions/actions/runs/7264551032","plan_hash":"4f2230c514d9fc46fb61dfc427717948113b598d9944e1a4e3aa63b3b86fb983","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-apply apply_apply_error__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
+   resource "aws_s3_bucket" "my_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "hello"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-apply #617](https://github.com/dflook/terraform-github-actions/actions/runs/7264551032)